---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetWindowType
source: html/0dcc038c-7d3f-a038-a53c-e8910683b16c.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetWindowType Method

Gets the analytic window type this surface is associated with.

## Syntax (C#)
```csharp
public EnergyAnalysisWindowType GetWindowType()
```

## Returns
The analytic window type.